#+title: CPP Quicknotes
#+author: Karl Statz
#+email: kstatz@colum.edu

* Basics
What would a C++ cheat sheet/quick guide be without a Hello World example:
#+BEGIN_SRC cpp
#include <iostream>

int main(int argc, char** argv)
{
    std::cout << "Hello World" << std::endl;
}
#+END_SRC

#+RESULTS:
: Hello World

This is a fully complete c++ program that, in theory should print "Hello World". Lets go from top to bottom to figure out what all this means

#+BEGIN_SRC cpp
#include <iostream>
#+END_SRC

the #include statement is a pre-processor directive to include a header file in your program. In this case we are including the iostream header.[[https://en.cppreference.com/w/cpp/header][This link]] is an exhaustive list of headers included with the c++ Standard Library. In this case iostream contains the cout object. The call semantics for c++ are a bit unique and a stark contrast to C.

#+BEGIN_SRC
//std is the namespace std (standard)
//:: is the scope operator
//cout is the name of the object getting called
//<< is the pipe operator
//"Hello World" is the data sent over the pipe to cout
//std::endl this is a portable endline call that both appends \n, \r depending on platform
//small note, std::endl also flushes the stream
std::cout << "Hello World" << std::endl;
#+END_SRC

This is a very different beast than c's printf method.

#+BEGIN_SRC c
#include <cstdio>
int main()
{
    printf("%s", "Hello World");
}
#+END_SRC

Notice we, in c++, include cstdio instead of stdio.h. This delves into a problem that a lot of young c++ programmers run into which is how to not stomp all over the global namespace. the c++ style includes for c headers use namespaces instead of just inserting into the global namespace

#+BEGIN_SRC cpp
#include <iostream>
using std;

int  main()
{
   cout << "hello world" << endl;
}
#+END_SRC

This might look cleaner, but using std will import all of std into the global namespace which can cause collisions if you have the same name for things in your code (custom string implementations come to mind)
